Revit 2024 API
ExternalFileReference.IsValidExternalFileReference Method
 Checks an ExternalFileReference to see if it is properly created.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public static bool IsValidExternalFileReference(
	ExternalFileReference data
)
Visual Basic
Public Shared Function IsValidExternalFileReference ( _
	data As ExternalFileReference _
) As Boolean
Visual C++
public:
static bool IsValidExternalFileReference(
	ExternalFileReference^ data
)
Parameters
data
Type: Autodesk.Revit.DB.ExternalFileReference
 The ExternalFileReference to be checked
Remarks
 The following restrictions exist:
 PathType.Server is only valid for ExternalFileReferences of type ExternalFileReferenceType.RevitLink
 PathType.Content is only valid for ExternalFileReferences of type ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable or ExternalFileReferenceType.Decal
 Keynote tables, assembly code tables and Decals (ExternalFileReferenceType.KeynoteTable, ExternalFileReferenceType.AssemblyCodeTable and ExternalFileReferenceType.Decal) may only be LinkedFileStatus.Loaded or LinkedFileStatus.NotFound.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternalFileReference Class
Autodesk.Revit.DB Namespace